Tekla Open API Reference for Tekla Structures 2025
RebarItem Methods
The RebarItem type exposes the following members.
Methods
Name | Description
Delete
 Deletes the rebar item from the rebar database.
Export
 Exports the rebar item in the catlog to given file name. If path is not given rebar is exported to model folder. If filename is empty rebar name is used as filename.
Insert
 Inserts the rebar item in the rebar database.
Modify
 Modifies the rebar item in the rebar database based on the given parameters.
Select(String, String)
 Selects the rebar item in the rebar database.
Select(String, Double, Boolean)
 Selects the rebar item in the rebar database.
Select(String, String, Double)
 Selects the rebar item in the rebar database.
Select(String, String, String)
 Selects the rebar item in the rebar database.
Select(String, Double, Double, Boolean)
 Selects the rebar item in the rebar database.
Select(String, Double, String, Boolean)
 Selects the rebar item in the rebar database.
Top
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace